[
  {
    "title": "Instagram Automation Chrome Extension",
    "meta": "2023",
    "description": [
      "Built a Chrome extension automating engagement workflows such as follow/unfollow and targeted interactions.",
      "Optimized automation logic with human-like delays and DOM-based triggers to reduce detection risk."
    ]
  },
  {
    "title": "E-commerce Platform (Shopify-like Clone)",
    "meta": "2023 – 2024",
    "description": [
      "Developed a fully functional multi-vendor e-commerce system with product catalogs, checkout, order tracking, and store dashboards.",
      "Implemented custom themes, merchant onboarding, inventory management, and secure payment integrations.",
      "Delivered a stable, production-grade platform with full documentation and deployment setup."
    ]
  },
  {
    "title": "Construction Business Management System",
    "meta": "2024",
    "description": [
      "Developed a construction workflow management system including project tracking, billing, and employee logs.",
      "Implemented real-time updates using WebSockets and multi-role permissions for contractors and site managers."
    ]
  },
  {
    "title": "Freelancer.com-like Marketplace Platform",
    "meta": "2024",
    "description": [
      "Developing a freelance marketplace with bidding system, escrow workflows, messaging, and milestone tracking.",
      "Architecting scalable microservices using FastAPI, PostgreSQL, and Redis for background queues and notifications.",
      "Building dynamic React dashboards for clients, freelancers, and admins with advanced filtering."
    ]
  },
  {
    "title": "NoSQL Database Simulator",
    "meta": "2025",
    "description": [
      "Developed a configurable NoSQL engine supporting document and key-value operations.",
      "Implemented schema validators, indexing logic, and error-resilient CRUD operations."
    ]
  },
  {
    "title": "Smart Attendance System",
    "meta": "Apr. 2025",
    "description": [
      "Created a tamper-proof attendance system using Kotlin Multiplatform, Wi-Fi scanning, and facial recognition.",
      "Implemented real-time syncing, offline caching, and monitoring dashboard."
    ]
  },
  {
    "title": "Redis-Based HA Clustering for Mattermost",
    "meta": "Apr. 2025",
    "description": [
      "Designed high-availability architecture using Redis leader election and cluster recovery logic.",
      "Reduced downtime by 30% and improved consistency under load."
    ]
  },
  {
    "title": "NeroSpatial – AI Smart Glasses with Photographic Memory",
    "meta": "2025 – Present",
    "description": [
      "Building full-stack pipeline powering AI smart glasses with spatial memory and real-time reasoning.",
      "Integrated BLE pairing, I²S audio processing, sensor fusion, and multimedia streaming.",
      "Developed backend using FastAPI, GPU inference routing, Faster-Whisper ASR, Gemini LLM, and vector memory graphs.",
      "Engineered Raspberry Pi CM5 and ESP32-S3 hardware prototypes for audio/video capture and cloud inference."
    ]
  }
]
